azogue/hass_config/esp8266_sensors/mqtt_pir_vibro_light_dht22_publisher.c
  #define PIN_PIR                             21     //IO21
  #define PIN_VIBRO                           22     //IO22
  #define PIN_LIGHT_SENSOR_DIGITAL            34     //IO34
  #define PIN_LIGHT_SENSOR_ANALOG             35
#else  // use esp8266
//  #define DHTPIN                              2      //D4 (DHT sensor)
//  #define LED_PIR                             4     //D2 - in dht11 breadboard
  #define LED_PIR                             16     //D0
  #define LED_VIBRO                           3      //RX - in dht11 breadboard
  #define LED_RGB_RED                         12     //D6
  #define LED_RGB_GREEN                       13     //D7
  #define LED_RGB_BLUE                        15     //D8
//  #define PIN_PIR                             5      //D1
  #define PIN_PIR                             2      //D4
  #define PIN_VIBRO                           0      //D3 - dht11 breadboard
//  #define PIN_VIBRO                           4      //D2 - dht22 box
  #define PIN_LIGHT_SENSOR_DIGITAL            14     //D5
  #define PIN_LIGHT_SENSOR_ANALOG             A0     //A0

  #define PIN_I2C_BME280_SDA                  4     //D2
  #define PIN_I2C_BME280_SCL                  5     //D1
#endif

//**********************************
//** Configuración *****************
//**********************************
#define VERBOSE                             true

#define MQTT_POSTINTERVAL_DHT22_SEC         40
#define MQTT_POSTINTERVAL_BME280_SEC        40
#define MQTT_POSTINTERVAL_LIGHT_SEC         45

#define DELAY_MIN_MS_ENTRE_MOVS             5000
#define DELAY_MIN_MS_ENTRE_VIBRO_SENSOR     4000
#define DELAY_MIN_MS_ENTRE_LIGHT_SENSOR     3000

#define DELTA_MS_TO_TURN_OFF_MOVS           3000
#define DELTA_MS_TO_TURN_OFF_VIBRO          3000
#define PERSISTENT_STATE_MS_UNTIL_STANDBY   2000

//Settings for recording samples
#define RESULTS_SAMPLE_RATE                 8            // # seconds between samples
#define SENSOR_HISTORY_RECORDS              10           // # records to keep
#define NUM_MAX_ERRORS_DHT                  20           // Abort on max

//**********************************
//** Librerías *********************
//**********************************
#ifdef USE_ESP32
  #include "WiFiEsp.h"
#else
  #include <ESP8266WiFi.h>
#endif
#include <PubSubClient.h>
#include <ArduinoJson.h>
#include <elapsedMillis.h>
#include <list>
#ifdef DHTPIN
  #include <Adafruit_Sensor.h>  // - Adafruit Unified Sensor Library: https://github.com/adafruit/Adafruit_Sensor
  #include <DHT.h>              // - DHT Sensor Library: https://github.com/adafruit/DHT-sensor-library
  #include <DHT_U.h>
#endif
#ifdef PIN_I2C_BME280_SDA
  #include <Wire.h>
  #include <Adafruit_Sensor.h>
  #include <Adafruit_BME280.h>
#endif

//**********************************
//** Variables *********************
//**********************************
#define DELAY_MS_BETWEEN_RETRIES            250

char MAC_char[18];                          //MAC address in ascii
//Wifi client
#ifdef USE_ESP32
  WiFiEspClient wifiClient;
#else
  WiFiClient wifiClient;
#endif
//MQTT client
void callback_mqtt_message_received(char* topic, byte* payload, unsigned int length);
PubSubClient client(MQTT_SERVER, MQTT_PORT, callback_mqtt_message_received, wifiClient);

// Control switches:
bool use_leds = HIGH;
bool use_binary_sensors = HIGH;

#ifdef DHTPIN                               // DHT22/DHT11 sensor settings.
DHT_Unified dht(DHTPIN, DHTTYPE);
// Variables for recording samples of the DHT22 sensor.
std::list<double> tempSamples;   //Collected results per interval
std::list<double> humidSamples;  //Collected results per interval
std::list<double> tempHistory;   //History over time.
std::list<double> humidHistory;  //History over time.
#endif

#ifdef PIN_I2C_BME280_SDA                   // BME280 sensor (I2C)
Adafruit_BME280 bme;                        // I2C
// Variables for recording samples of the DHT22 sensor.
std::list<double> bme_tempSamples;   //Collected results per interval
std::list<double> bme_humidSamples;  //Collected results per interval
std::list<double> bme_pressureSamples;  //Collected results per interval
std::list<double> bme_tempHistory;   //History over time.
std::list<double> bme_humidHistory;  //History over time.
std::list<double> bme_pressureHistory;  //History over time.
#endif

// Contadores de tiempo
elapsedMillis sinceStart;
int last_sensor_error;
int last_sensor_ok;
int last_dht_sensed;         //The last time a sample was taken from the DHT22 sensor.
int last_bme_sensed;         //The last time a sample was taken from the BME280 sensor.
int error_counter_dht;

int last_dht22_post;            // Init value to wait some time before the 1st publish.
int last_bme280_post;            // Init value to wait some time before the 1st publish.
int last_light_post;            // Init value to wait some time before the 1st publish.
int last_state_change;

// Estados (para el output LED RGB)
#define STATE_ERROR            1
#define STATE_WARN             2
#define STATE_BIN_PUBLISH      3
#define STATE_OK_MEASURE       4
#define STATE_OK_PUBLISH       5
#define STATE_INIT             6
#define STATE_STANDBY          7
#define STATE_CRITICAL         8
int current_state;

// Binary sensors variables for control them within interrupts
volatile int last_pir_trigered = 0;
volatile int last_vibro_trigered = 0;
volatile int last_light_trigered = 0;

volatile bool pir_state = LOW;
volatile bool vibro_state = LOW;
volatile bool light_state = LOW;
bool last_light_post_state = LOW;

volatile bool flag_publish_pir = LOW;
volatile bool flag_publish_vibro = LOW;
volatile bool flag_publish_light = LOW;

//**********************************
//** SETUP
//**********************************
void setup()
{
  uint8_t MAC_array[6];

  Serial.begin(9600);
  setup_timers();
  setup_leds();
  set_state(STATE_INIT);
  connectWiFi();

  //Get the mac and convert it to a string.
  WiFi.macAddress(MAC_array);
  for (int i = 0; i < sizeof(MAC_array); ++i)
  {
    sprintf(MAC_char, "%s%02x", MAC_char, MAC_array[i]);
  }

#ifdef DHTPIN
  setup_dht_sensor();
#endif
#ifdef PIN_I2C_BME280_SDA
  setup_bme280_sensor();
#endif
  setup_boolean_sensors();

  if (VERBOSE) {
    Serial.print("MAC ADRESS: ");
    Serial.println(MAC_char);
  }
  set_state(STATE_CRITICAL);
}

//**********************************
//** LOOP
//**********************************
const char *i_text_state_pubsubclient(int state)
{
  //Returns the current state of the client. If a connection attempt fails, this can be used to get more information about the failure.
  switch (state)
  {
    case -4:
      return "MQTT_CONNECTION_TIMEOUT - the server didn't respond within the keepalive time";
    case -3:
      return "MQTT_CONNECTION_LOST - the network connection was broken";
    case -2:
      return "MQTT_CONNECT_FAILED - the network connection failed";
    case -1:
      return "MQTT_DISCONNECTED - the client is disconnected cleanly";
    case 0:
      return "MQTT_CONNECTED - the cient is connected";
    case 1:
      return "MQTT_CONNECT_BAD_PROTOCOL - the server doesn't support the requested version of MQTT";
    case 2:
      return "MQTT_CONNECT_BAD_CLIENT_ID - the server rejected the client identifier";
    case 3:
      return "MQTT_CONNECT_UNAVAILABLE - the server was unable to accept the connection";
    case 4:
      return "MQTT_CONNECT_BAD_CREDENTIALS - the username/password were rejected";
    case 5:
      return "MQTT_CONNECT_UNAUTHORIZED - the client was not authorized to connect";
  }
  return "MQTT_STATE ????";
}

void loop()
{
  bool sensor_ok = false;
  bool sensed_data = false;
  bool bin_publish = false;
  int mqtt_retries = 0;

  //Reconnect if disconnected.
  if(WiFi.status() != WL_CONNECTED)
  {
    set_state(STATE_CRITICAL);
    connectWiFi();
  }

  //Check the MQTT connection and process it
  if (!client.connected())
  {
    while (!client.connected())
    {
      if (!client.connect(MQTT_USERID, MQTT_USER, MQTT_PASSWORD,
                          (MQTT_WILLTOPIC + String(MAC_char)).c_str(), MQTT_WILLQOS,
                          MQTT_WILLRETAIN, MQTT_STATE_OFF))
      {
        set_state(STATE_ERROR);
        Serial.print(i_text_state_pubsubclient(client.state()));
        Serial.print("MQTT retry # ");
        Serial.println(mqtt_retries);
        delay(DELAY_MS_BETWEEN_RETRIES);
      }
      mqtt_retries += 1;
    }
    client.publish((MQTT_WILLTOPIC + String(MAC_char)).c_str(), MQTT_STATE_ON, MQTT_WILLRETAIN);
    client.publish((mqtt_control_topic + String(MAC_char) + mqtt_switch_bin_sensors_subtopic).c_str(),
                   use_binary_sensors ? MQTT_STATE_ON : MQTT_STATE_OFF, HIGH);
    client.subscribe((mqtt_control_topic + String(MAC_char) + mqtt_switch_bin_sensors_subtopic + mqtt_subtopic_set).c_str()); // , 1);

