azogue/hass_config/esp8266_sensors/mqtt_pir_vibro_light_dht22_publisher.c
    client.publish((mqtt_control_topic + String(MAC_char) + mqtt_switch_leds_subtopic).c_str(),
                   use_leds ? MQTT_STATE_ON : MQTT_STATE_OFF, HIGH);
    client.subscribe((mqtt_control_topic + String(MAC_char) + mqtt_switch_leds_subtopic + mqtt_subtopic_set).c_str()); // , 1);
  }
  client.loop();

  turn_off_motion_sensors_after_delay();
  bin_publish = publish_motion_and_light_sensors_if_flag_or_delta();
#ifdef DHTPIN
  sample_dht22_sensor_data(&sensed_data, &sensor_ok);
#endif
#ifdef PIN_I2C_BME280_SDA
  sample_bme280_sensor_data(&sensed_data, &sensor_ok);
#endif
  if (publish_dht22_sensor_data() || publish_bme280_sensor_data())
  {
    set_state(STATE_OK_PUBLISH);
  }
  else if (sensed_data && sensor_ok)
  {
    set_state(STATE_OK_MEASURE);
  }
  else if (sensed_data)
  {
    set_state(STATE_WARN);
  }
  else if (bin_publish)
  {
    set_state(STATE_BIN_PUBLISH);
  }
  else
  {
    auto_standby();
  }
}

//**********************************
//** METHODS
//**********************************

void auto_standby()
{
  if ((sinceStart - last_state_change > PERSISTENT_STATE_MS_UNTIL_STANDBY)
      && current_state != STATE_STANDBY && !i_state_critical())
  {
    set_state(STATE_STANDBY);
  }
}

void turn_off_motion_sensors_after_delay()
{
#ifdef PIN_PIR
  // PIR binary sensor to off after a delay:
  if (pir_state && (sinceStart - last_pir_trigered > DELTA_MS_TO_TURN_OFF_MOVS))
  {
    pir_state = LOW;
    flag_publish_pir = HIGH;
  }
#endif

#ifdef PIN_VIBRO
  // Vibration binary sensor to off after a delay:
  if (vibro_state && (sinceStart - last_vibro_trigered > DELTA_MS_TO_TURN_OFF_VIBRO))
  {
    vibro_state = LOW;
    flag_publish_vibro = HIGH;
  }
#endif
}

bool publish_motion_and_light_sensors_if_flag_or_delta()
{
  bool any_publish = false;
#ifdef PIN_PIR
  // Update PIR state:
  if (flag_publish_pir)
  {
#ifdef LED_PIR
    if (use_leds)
      digitalWrite(LED_PIR, pir_state);
#endif
    flag_publish_pir = !publish_mqtt_binary_sensor("MOVEMENT", "MOVEMENT OFF", pir_state, mqtt_movement_topic);
    any_publish = !flag_publish_pir;
  }
#endif

#ifdef PIN_VIBRO
  // Update vibro sensor state:
  if (flag_publish_vibro)
  {
#ifdef LED_VIBRO
    if (use_leds)
      digitalWrite(LED_VIBRO, vibro_state);
#endif
    flag_publish_vibro = !publish_mqtt_binary_sensor("VIBRATION", "VIBRATION OFF", vibro_state, mqtt_vibro_topic);
    any_publish = !flag_publish_vibro || any_publish;
  }
#endif

#ifdef PIN_LIGHT_SENSOR_DIGITAL
  // Update LIGHT state:
  if (flag_publish_light || (sinceStart - last_light_post > MQTT_POSTINTERVAL_LIGHT_SEC * 1000))
  {
    float light_percentage;

    if (!flag_publish_light)
    {
      light_state = digitalRead(PIN_LIGHT_SENSOR_DIGITAL);
      if (light_state != last_light_post_state)
      {
        last_light_post_state = light_state;
        flag_publish_light = !publish_mqtt_binary_sensor("LIGHT", "LIGHT OFF", !light_state, mqtt_light_topic);
        any_publish = !flag_publish_light || any_publish;
      }
    }
    else
    {
      last_light_post_state = light_state;
      flag_publish_light = !publish_mqtt_binary_sensor("LIGHT", "LIGHT OFF", !light_state, mqtt_light_topic);
      any_publish = !flag_publish_light || any_publish;
    }

#ifdef PIN_LIGHT_SENSOR_ANALOG
    light_percentage = read_analog_light_percentage();
    flag_publish_light = !publish_mqtt_data("LIGHT", mqtt_light_analog_topic,
                                            String(light_percentage).c_str(), false);
    any_publish = !flag_publish_light || any_publish;
#endif

    if (!flag_publish_light)
      last_light_post = sinceStart;

  }
#endif

  return any_publish;
}

bool publish_dht22_sensor_data()
{
#ifdef DHTPIN
  //post MQTT DHT22 data every X seconds
  if ((error_counter_dht == 0) && (sinceStart - last_dht22_post > MQTT_POSTINTERVAL_DHT22_SEC * 1000))
  {
    bool publishing = false;

    calc_sensor_stats(&tempSamples, &tempHistory);
    if(tempHistory.size() > 0)
    {
      publishing = publish_mqtt_data("TEMP", mqtt_temp_topic,
                                     String(tempHistory.front()).c_str(), false);
    }

    calc_sensor_stats(&humidSamples, &humidHistory);
    if(humidHistory.size() > 0)
    {
      publishing = publish_mqtt_data("HUMID", mqtt_humid_topic,
                                     String(humidHistory.front()).c_str(), false);
    }

    if (publishing)
      last_dht22_post = sinceStart;

    return publishing;
  }
#endif

  return false;
}

bool publish_bme280_sensor_data()
{
#ifdef PIN_I2C_BME280_SDA
  //post MQTT BME280 data every X seconds
  if (sinceStart - last_bme280_post > MQTT_POSTINTERVAL_BME280_SEC * 1000)
  {
    bool publishing = false;

    calc_sensor_stats(&bme_tempSamples, &bme_tempHistory);
    calc_sensor_stats(&bme_humidSamples, &bme_humidHistory);
    calc_sensor_stats(&bme_pressureSamples, &bme_pressureHistory);
    if(bme_tempHistory.size() > 0)
      publishing = publish_mqtt_data("TEMP", mqtt_temp_topic,
                                     String(bme_tempHistory.front()).c_str(), false);
    if(bme_humidHistory.size() > 0)
      publishing = publish_mqtt_data("HUMID", mqtt_humid_topic,
                                     String(bme_humidHistory.front()).c_str(), false);
    if(bme_pressureHistory.size() > 0)
      publishing = publish_mqtt_data("PRESSURE", mqtt_pressure_topic,
                                     String(bme_pressureHistory.front()).c_str(), false);

    if (publishing)
      last_bme280_post = sinceStart;

    return publishing;
  }
#endif
  return false;
}

bool publish_mqtt_data(const char* type_publish, const char* topic_prefix, const char* payload, boolean retained)
{
  if (VERBOSE) {
    Serial.print("PUBLISH ");
    Serial.print(type_publish);
    Serial.print(": topic=");
    Serial.print((topic_prefix + String(MAC_char)).c_str());
    Serial.print(" -> ");
    Serial.println(payload);
  }
  return client.publish((topic_prefix + String(MAC_char)).c_str(), payload, retained);
}

bool publish_mqtt_binary_sensor(const char* name_on, const char* name_off,
                                bool state, const char* topic)
{
  if (state)
    return publish_mqtt_data(name_on, topic, MQTT_STATE_ON, true);
  else
    return publish_mqtt_data(name_off, topic, MQTT_STATE_OFF, true);
}

