azogue/hass_config/esp8266_sensors/mqtt_pir_vibro_light_dht22_publisher.c
void set_color_rgb(uint16_t red, uint16_t green, uint16_t blue)
{
#ifdef LED_RGB_RED
#ifdef USE_ESP32
  // hueToRGB(color, brightness);  // call function to convert hue to RGB
  // write the RGB values to the pins
  ledcWrite(1, (uint32_t)(red / 4)); // write red component to channel 1, etc.
  ledcWrite(2, (uint32_t)(green / 4));
  ledcWrite(3, (uint32_t)(blue / 4));
#else
  analogWrite(LED_RGB_RED, red);
  analogWrite(LED_RGB_GREEN, green);
  analogWrite(LED_RGB_BLUE, blue);
#endif
#endif
}

bool i_state_critical()
{
  switch (current_state)
  {
    case STATE_INIT:
    case STATE_OK_MEASURE:
    case STATE_OK_PUBLISH:
    case STATE_BIN_PUBLISH:
    case STATE_STANDBY:
    {
      return false;
    }
//    case STATE_WEBACCESS:
    case STATE_ERROR:
    case STATE_WARN:
    case STATE_CRITICAL:
    {
      return true;
    }
  }
}

void set_state(int new_state)
{
  bool state_changed = current_state != new_state;
  current_state = new_state;
  last_state_change = sinceStart;

  // Set RGB LED state:
  if (use_leds)
  {
    switch (current_state)
    {
      case STATE_INIT:
      {
        set_color_rgb(1023, 1023, 1023);
        break;
      }
      case STATE_ERROR:
      {
        if (VERBOSE && state_changed)
          Serial.println("ERROR STATE (red)");
        set_color_rgb(1023, 0, 0);
        break;
      }
      case STATE_WARN:
      {
        if (VERBOSE && state_changed)
          Serial.println("WARNING STATE (R+.5G)");
        set_color_rgb(1023, 512, 0);
        break;
      }
      case STATE_CRITICAL:
      {
        if (VERBOSE && state_changed)
          Serial.println("CRITICAL STATE (violet)");
        set_color_rgb(1023, 0, 1023);
        break;
      }
      case STATE_OK_MEASURE:
      {
        set_color_rgb(0, 0, 1023);
        break;
      }
      case STATE_OK_PUBLISH:
      {
      //      Serial.println("OK PUBLISH");
        set_color_rgb(0, 1023, 0);
        break;
      }
      case STATE_BIN_PUBLISH:
      {
      //      Serial.println("OK PUBLISH");
        set_color_rgb(0, 255, 512);
        break;
      }
      case STATE_STANDBY:
      {
        set_color_rgb(0, 0, 0);
        break;
      }
    }
  }
}

void isr_pir_change()
{
  if (use_binary_sensors && !pir_state && (sinceStart - last_pir_trigered > DELAY_MIN_MS_ENTRE_MOVS))
  {
    pir_state = HIGH;
    flag_publish_pir = HIGH;
  }
  last_pir_trigered = sinceStart;
}

void isr_vibro_change()
{
  if (use_binary_sensors && !vibro_state && (sinceStart - last_vibro_trigered > DELAY_MIN_MS_ENTRE_VIBRO_SENSOR))
  {
    vibro_state = HIGH;
    flag_publish_vibro = HIGH;
  }
  last_vibro_trigered = sinceStart;
}

#ifdef PIN_LIGHT_SENSOR_DIGITAL
void isr_light_sensor_change()
{
  if (use_binary_sensors && sinceStart - last_light_trigered > DELAY_MIN_MS_ENTRE_LIGHT_SENSOR)
  {
    bool new_light_state = digitalRead(PIN_LIGHT_SENSOR_DIGITAL);
    if (new_light_state != light_state)
    {
      light_state = !light_state;
      flag_publish_light = HIGH;
    }
  }
  last_light_trigered = sinceStart;
}
#endif

#ifdef PIN_LIGHT_SENSOR_ANALOG
float read_analog_light_percentage()
{
  return round(100. * (1023 - analogRead(PIN_LIGHT_SENSOR_ANALOG)) /  10.23) / 100.;
}
#endif

void sample_dht22_sensor_data(bool *sampled, bool *sample_ok)
{
  *sampled = false;
  *sample_ok = false;

#ifdef DHTPIN
  // Collect the DHT22 sensor data
  if(sinceStart - last_dht_sensed > RESULTS_SAMPLE_RATE * 1000)
  {
    double temp = -999;
    double humid = -999;
    sensors_event_t event;

    *sampled = true;
    //Collect the temperature from a sensor.
    dht.temperature().getEvent(&event);
    if (!isnan(event.temperature))
    {
      temp = event.temperature;
      if (VERBOSE) {
        Serial.print("Temp: ");
        Serial.print(temp);
        Serial.print(" ^C, ");
      }
    }
    // Get humidity event and print its value.
    dht.humidity().getEvent(&event);
    if (!isnan(event.relative_humidity))
    {
      humid = event.relative_humidity;
      if (VERBOSE) {
        Serial.print("Humidity: ");
        Serial.print(humid);
        Serial.println(" %");
      }
    }

    if ((temp == -999) || (humid == -999))
    {
      sensor_t sensor;
      if (VERBOSE) {
        Serial.print("DHT ERROR # ");
        Serial.print(error_counter_dht);
        Serial.print(": ");
        Serial.print(temp);
        Serial.print(" / ");
        Serial.println(humid);
      }
      dht.begin();
      dht.temperature().getSensor(&sensor);
      last_sensor_error = sinceStart;
      error_counter_dht += 1;
      *sample_ok = false;

      if (error_counter_dht > NUM_MAX_ERRORS_DHT)
        reset_exec();
    }
    else
    {
      last_sensor_ok = sinceStart;
      *sample_ok = true;
      error_counter_dht = 0;

      //Make sure a valid temperature was sampled
      if(temp != -999)
        tempSamples.push_front(temp);

      if(humid != -999)
        humidSamples.push_front(humid);
    }

    last_dht_sensed = sinceStart;
  }
#endif
}

void sample_bme280_sensor_data(bool *sampled, bool *sample_ok)
{
  *sampled = false;
  *sample_ok = false;

#ifdef PIN_I2C_BME280_SDA
  // Collect the sensor data
  if(sinceStart - last_bme_sensed > RESULTS_SAMPLE_RATE * 1000)
  {
    double temp, humid, pressure;

    *sampled = true;
    *sample_ok = true;
    temp = bme.readTemperature();
    humid = bme.readHumidity();
    pressure = bme.readPressure() / 100.0F;
    // #define SEALEVELPRESSURE_HPA (1013.25)      // 1 atm std.
    //bme.readAltitude(SEALEVELPRESSURE_HPA);

    if (VERBOSE) {
      Serial.print("Temp: ");
      Serial.print(temp);
      Serial.print(" ^C, ");
      Serial.print("Humidity: ");
      Serial.print(humid);
      Serial.print(" %, ");
      Serial.print("Pressure: ");
      Serial.print(pressure);
      Serial.println(" mbar");
    }

    bme_tempSamples.push_front(temp);
    bme_humidSamples.push_front(humid);
    bme_pressureSamples.push_front(pressure);
    last_bme_sensed = sinceStart;
  }
#endif
}

void calc_sensor_stats(std::list<double> *samples, std::list<double> *history)
{
  int count = 0;
  double samples_sum = 0;
  double samples_average;

  if(samples->size() > 0)
  {
    for(std::list<double>::iterator sensiter = samples->begin(); sensiter != samples->end(); sensiter++)
    {
      count++;
      samples_sum += *sensiter;
    }
    samples_average = samples_sum / count;

    //Add the new data to the history.
    history->push_front(samples_average);
    if(history->size() > SENSOR_HISTORY_RECORDS)
    {
      history->pop_back();
    }
  }
  samples->clear();
}

//**********************************
//** Setup methods
//**********************************
void setup_timers()
{
  sinceStart = 0;
  last_state_change = 0;
  last_sensor_error = 0;
  last_sensor_ok = 0;
  last_dht_sensed = 0;                //The last time a sample was taken from the DHT22 sensor.
  error_counter_dht = 1;
  last_dht22_post = 15000;            // Init value to wait some time before the 1st publish.
  last_light_post = 15000;            // Init value to wait some time before the 1st publish.
  flag_publish_light = HIGH;
}

void setup_leds()
{
#ifdef LED_PIR
  pinMode(LED_PIR, OUTPUT);
#endif
#ifdef LED_VIBRO
  pinMode(LED_VIBRO, OUTPUT);
#endif

#ifdef LED_RGB_RED
#ifdef USE_ESP32
  ledcAttachPin(LED_RGB_RED, 1); // assign RGB led pins to channels
  ledcAttachPin(LED_RGB_GREEN, 2);
  ledcAttachPin(LED_RGB_BLUE, 3);
  // Initialize channels
  // channels 0-15, resolution 1-16 bits, freq limits depend on resolution
  // ledcSetup(uint8_t channel, uint32_t freq, uint8_t resolution_bits);
  ledcSetup(1, 12000, 8); // 12 kHz PWM, 8-bit resolution
  ledcSetup(2, 12000, 8);
  ledcSetup(3, 12000, 8);
#else
  pinMode(LED_RGB_RED, OUTPUT);
  pinMode(LED_RGB_GREEN, OUTPUT);
  pinMode(LED_RGB_BLUE, OUTPUT);
#endif
#endif
}

#ifdef DHTPIN
void setup_dht_sensor()
{
  dht.begin();
  sensor_t sensor;
  dht.temperature().getSensor(&sensor);
  if (VERBOSE) {
    Serial.println("------------------------------------");
    Serial.println("Temperature");
    Serial.print  ("Sensor:       "); Serial.println(sensor.name);
    Serial.print  ("Driver Ver:   "); Serial.println(sensor.version);
    Serial.print  ("Unique ID:    "); Serial.println(sensor.sensor_id);
    Serial.print  ("Max Value:    "); Serial.print(sensor.max_value); Serial.println(" *C");
    Serial.print  ("Min Value:    "); Serial.print(sensor.min_value); Serial.println(" *C");
    Serial.print  ("Resolution:   "); Serial.print(sensor.resolution); Serial.println(" *C");
    Serial.println("------------------------------------");
  }
  dht.humidity().getSensor(&sensor);
  // Print humidity sensor details.
  dht.humidity().getSensor(&sensor);
  if (VERBOSE) {
    Serial.println("------------------------------------");
    Serial.println("Humidity");
    Serial.print  ("Sensor:       "); Serial.println(sensor.name);
    Serial.print  ("Driver Ver:   "); Serial.println(sensor.version);
    Serial.print  ("Unique ID:    "); Serial.println(sensor.sensor_id);
    Serial.print  ("Max Value:    "); Serial.print(sensor.max_value); Serial.println("%");
    Serial.print  ("Min Value:    "); Serial.print(sensor.min_value); Serial.println("%");
    Serial.print  ("Resolution:   "); Serial.print(sensor.resolution); Serial.println("%");
    Serial.println("------------------------------------");
  }
}
#endif

#ifdef PIN_I2C_BME280_SDA
void setup_bme280_sensor()
{
    bool bme_status;

    // default settings
    bme_status = bme.begin();
    if (!bme_status)
    {
        Serial.println("Could not find a valid BME280 sensor, check wiring!");
        set_state(STATE_CRITICAL);
        delay(10000);
        reset_exec();
    }

    delay(100); // let sensor boot up
}
#endif

