azogue/hass_config/esp8266_sensors/mqtt_pir_vibro_light_dht22_publisher.c
void setup_boolean_sensors()
{
#ifdef PIN_PIR
  pinMode(PIN_PIR, INPUT);
  attachInterrupt(digitalPinToInterrupt(PIN_PIR), isr_pir_change, CHANGE);
#endif

#ifdef PIN_VIBRO
  pinMode(PIN_VIBRO, INPUT);
  attachInterrupt(digitalPinToInterrupt(PIN_VIBRO), isr_vibro_change, CHANGE);
#endif

#ifdef PIN_LIGHT_SENSOR_DIGITAL
  pinMode(PIN_LIGHT_SENSOR_DIGITAL, INPUT);
  attachInterrupt(digitalPinToInterrupt(PIN_LIGHT_SENSOR_DIGITAL), isr_light_sensor_change, CHANGE);
#endif

#ifdef PIN_LIGHT_SENSOR_ANALOG
  pinMode(PIN_LIGHT_SENSOR_ANALOG, INPUT);
#endif
}

void connectWiFi()
{
  elapsedMillis wifi_try = 0;
#ifdef USE_ESP32
  //char *pass = (char*) malloc(strlen(WiFiPSK));
  //strcpy(pass, WiFiPSK);
  WiFi.begin((char *)WiFiSSID, (const char *)WiFiPSK);
#else
  WiFi.mode(WIFI_STA);
  WiFi.begin(WiFiSSID, WiFiPSK);
#endif

  if (VERBOSE) {
    Serial.print("Attempting to connect to WPA SSID: ");
    Serial.print(WiFiSSID);
  }

  set_state(STATE_CRITICAL);
  while (WiFi.status() != WL_CONNECTED)
  {
    if (VERBOSE)
      Serial.print (".");
    //Delay until connected.
    delay(DELAY_MS_BETWEEN_RETRIES);
    if (wifi_try > 60000)
      reset_exec();
  }
  if (VERBOSE) {
    Serial.println("You're connected to the network");
    printWifiStatus();
  }
  set_state(STATE_STANDBY);
}

void printWifiStatus()
{
  // print the SSID of the network you're attached to
  Serial.print("SSID: ");
  Serial.println(WiFi.SSID());

  // print your WiFi shield's IP address
  IPAddress ip = WiFi.localIP();
  Serial.print("IP Address: ");
  Serial.println(ip);

#ifndef USE_ESP32
// print the received signal strength
  long rssi = WiFi.RSSI();
  Serial.print("Signal strength (RSSI):");
  Serial.print(rssi);
  Serial.println(" dBm");
#endif
}

void reset_exec()
{
  Serial.println("ABORTING ...");
  set_color_rgb(1023, 200, 200);
  delay(30000);
  ESP.restart();
}

//**********************************
//** MQTT Callback
//**********************************

bool read_json(byte *payload, unsigned int payload_length)
{
  StaticJsonBuffer<500> jsonBuffer;
  char *json = (char*)payload;
  JsonObject& root = jsonBuffer.parseObject(json);

  // Test if parsing succeeds.
  if (!root.success())
  {
    Serial.println("parseObject() failed");
    return false;
  }
  else if (root.containsKey("color"))
  {
    // Fetch values.
    uint16_t R, G, B;
    R = root["color"][0];
    G = root["color"][1];
    B = root["color"][2];
    Serial.print("RGB RECEIVED: (");
    Serial.print(R);
    Serial.print(", ");
    Serial.print(G);
    Serial.print(", ");
    Serial.print(B);
    Serial.println(")");
    set_color_rgb(4 * R, 4 * G, 4 * B);
    return client.publish((mqtt_control_topic_out + String(MAC_char)).c_str(), "COLOR SET");
  }
  else if (root.containsKey("led"))
  {
    bool new_use_leds = root["led"];
    Serial.print("RECEIVED LED USE=");
    Serial.print(new_use_leds);
    if (new_use_leds != use_leds)
    {
      use_leds = new_use_leds;
      set_state(STATE_STANDBY);
      return client.publish((mqtt_control_topic_out + String(MAC_char)).c_str(), "USE LED CHANGE OK");
    }
    return client.publish((mqtt_control_topic_out + String(MAC_char)).c_str(), "USE LED NO CHANGE");
  }
  else if (root.containsKey("binary_sensors"))
  {
    bool new_use_bin_sensors = root["binary_sensors"];
    Serial.print("RECEIVED BINARY_SENSORS USE=");
    Serial.print(new_use_bin_sensors);
    if (new_use_bin_sensors != use_binary_sensors)
    {
      use_binary_sensors = new_use_bin_sensors;
      return client.publish((mqtt_control_topic_out + String(MAC_char)).c_str(), "USE BINARY_SENSORS CHANGE OK");
    }
    return client.publish((mqtt_control_topic_out + String(MAC_char)).c_str(), "USE BINARY_SENSORS NO CHANGE");
  }

  return client.publish((mqtt_control_topic_out + String(MAC_char)).c_str(), payload, payload_length);
}

bool i_contains(const char *str1, const char *str2)
{
  char *contains;
  contains = strstr(str1, str2);
  if (contains)
    return true;
  return false;
}

void callback_mqtt_message_received(char* topic, byte* payload, unsigned int payload_length)
{
  char *message;
  byte *p = (byte*)malloc(payload_length);
  memcpy(p, payload, payload_length);
  message = (char*)p;

  Serial.println("MQTT MSG ARRIVED:");
  Serial.print(" --> topic=");
  Serial.println(topic);
  Serial.print(" --> payload=");
  Serial.println(message);

//  TODO separacion topics + states
  if (i_contains(topic, mqtt_switch_bin_sensors_subtopic) && i_contains(topic, mqtt_subtopic_set))
  {
    use_binary_sensors = i_contains(message, MQTT_STATE_ON);
    Serial.print("SET use_binary_sensors = ");
    Serial.println(use_binary_sensors ? MQTT_STATE_ON : MQTT_STATE_OFF);
    client.publish((mqtt_control_topic + String(MAC_char) + mqtt_switch_bin_sensors_subtopic).c_str(),
                   use_binary_sensors ? MQTT_STATE_ON : MQTT_STATE_OFF);
  }
  else if (i_contains(topic, mqtt_switch_leds_subtopic) && i_contains(topic, mqtt_subtopic_set))
  {
    use_leds = i_contains(message, MQTT_STATE_ON);
    if (!use_leds)
      set_state(STATE_STANDBY);
    Serial.print("SET use_leds = ");
    Serial.println(use_leds ? MQTT_STATE_ON : MQTT_STATE_OFF);
    client.publish((mqtt_control_topic + String(MAC_char) + mqtt_switch_leds_subtopic).c_str(),
                   use_leds ? MQTT_STATE_ON : MQTT_STATE_OFF);
  }
  else
  {
    read_json(p, payload_length);
  }
  free(p);
}
